<?php
/**
 * PHP 运算符
 * 在php中，赋值运算符 = 用于给变量复制。
 * 在php中，算数运算符 + 用于把值加在一起。
 * php算数运算符：
 *          +   加
 *          -   减
 *          *   乘
 *          /   除
 *          %   模（除数的余数）
 *          intdiv（整除运算）
 *          - x 取反
 *          .   并（链接两个字符串）
 * 赋值运算符：
 *           =  赋值 将右边的表达式赋值给给左边的操作数
 *          +=  加赋值
 *          -=  减赋值
 *          *=  乘赋值
 *          /=  除复制
 *          %=  模赋值
 *          .=  并赋值
 *
 * php递增/递减运算符：
 *          ++ x 预递增 x+1,然后返回x
 *          -- x 预递减 x-1,然后返回x
 *          x ++ 后递增 返回x 然后x+1
 *          x -- 后递减 返回x 然后x-1
 *
 *php 比较运算符
 *           == 等于
 *          === 绝对等于
 *           != 不等于
 *          !== 绝对不等于
 *           <> 绝对不等于
 *           >  大于
 *           <  小于
 *           >= 大于等于
 *           <= 小于等于
 *
 *
 *逻辑运算符
 *           and 与（并）
 *           &&  与（并）
 *           or  或（合）
 *           ||  或（合）
 *           !x  非
 *
 * 数组运算符
 *            x+y   集合   x和y的集合 (集合)
 *            x==y  相等   x和y具有相同的键值对，则返回true
 *            x===y 恒等   x和y具有相同的键值对，且顺序类型相同，则返回true
 *            x!=y  不相等 x不等于y则返回true
 *            x<>y  不相等 x不等于y则返回true
 *            x!==y 不恒等 x不等于y,则返回true
 *
 *
 * 三元运算符   expr1?expr2:expr3
 *
 * 组合比较符 $c= x<=>y 组合比较 x>y $c=1,
 *                               x==y $c=0
 *                               x<y  $c=-1
 */
