<?php
/**
 * 面向对象
 *
 * 面向对象的三个特征：
 *  1.对象的形态
 *  2.对象的行为
 *  3.对象的表示，对象的表示就相当于身份证，具体区别在相同的行为与状态下有什么不同
 *
 * 面向对象内容
 *
 * 1.类：定义了一类事物的抽象特点，类定义了类的形态以及对数据的操作
 * 2.对象：是类的实例
 * 3.成员变量：定义在类内部的变量,该变量的值对外是不可见的，但是可以通过成员函数访问，
 * 4.成员函数：定义在类内部可用于访问对象的数据。
 * 5.继类：继承性是子类自动共享父类数据结构和方法的机制。这是类之间的一种关系
 * 6.父类：一个类被其他类继承，可将该类称为父类，基类，或超类。
 * 8.子类：一个类继承其他类称为子类，也可称为派生类。
 * 9.多态：多态性是指相同的函数或方法可作用于多种类型的对象上并获得不同的结果。鸭子叫，格子叫，人叫，叫的多种形态。
 * 10.重载：简单来说就是函数或方法有相同的名称，但是参数列表不相同的情形。这样同名函数参数不同的叫着重载。
 * 11.抽象性：抽象性是指具有一致的数据结构（属性）和对象的行为抽象成一个类。一个类就是一种抽象。
 * 12.封装：封装是指现实世界中尊在的某个课题的属性与行为绑定在一起，并防止在一个逻辑单元内。
 * 13.构造函数：主要用来在创建对象时初始化对象，即为对象成员变量赋初值，
 * 14.析构函数：与构建函数相反，当对象结束生命周期时，通常是用来处理清理售后的工作。
 *
 */
